Seeing the same issue with release 1.0.0 

Terraform plan shows changes pending.

```
  # rke_cluster.cluster will be updated in-place
  ~ resource "rke_cluster" "cluster" {
        addon_job_timeout         = 60
...
        client_key                = (sensitive value)
      ~ cluster_cidr              = "10.42.0.0/16" -> (known after apply)
      ~ cluster_dns_server        = "10.43.0.10" -> (known after apply)
      ~ cluster_domain            = "cluster.local" -> (known after apply)
        cluster_name              = "rke-test-cluster"
...
        kube_admin_user           = "kube-admin"
      ~ kube_config_yaml          = (sensitive value)
        kubernetes_version        = "v1.16.9-rancher1-1"
        prefix_path               = "/"
      ~ rke_cluster_yaml          = (sensitive value)
      ~ rke_state                 = (sensitive value)
        running_system_images     = [
...
      ~ network {
            mtu     = 0
          ~ options = {
                "calico_cloud_provider"         = "none"
              - "calico_flex_volume_plugin_dir" = "/usr/libexec/kubernetes/kubelet-plugins/volume/exec/nodeagent~uds" -> null
            }
```

Terraform apply runs cleanly, but running plan shows the same changes still pending. 